In [1]:
import pandas as pd
import matplotlib as plt
import scipy as sp
%matplotlib inline

In [2]:
appearances = pd.read_csv("data/Appearances.csv")
batting = pd.read_csv("data/Batting.csv")
master = pd.read_csv("data/Master.csv")
salaries = pd.read_csv("data/Salaries.csv")

In [3]:
bat1 = batting[batting['yearID'] == 1985]
bat1 = bat1[['playerID','H','AB','BB','HBP','SF', 'yearID']]
bat1 = bat1.dropna()
bat1.head(2)

        playerID   H   AB  BB  HBP  SF  yearID
62238  abregjo01   0    9   0    0   0    1985
62240  adamsri02  23  121   5    1   0    1985

In [4]:
bat1["OBP"] = ""
bat1['OBP'] = (bat1.H + bat1.BB + bat1.HBP) / (bat1.AB + bat1.BB + bat1.HBP + bat1.SF)
bat2 = bat1.dropna()

In [5]:
bat2.head(2)

        playerID   H   AB  BB  HBP  SF  yearID       OBP
62238  abregjo01   0    9   0    0   0    1985  0.000000
62240  adamsri02  23  121   5    1   0    1985  0.228346

In [6]:
#this removes the outliers with a high percent due to few times at bat as well as removing poorer players from the mix
bat3 = bat2[(bat2.OBP >= .25) & (bat2.AB > 20)]  
bat3.head(2)

        playerID   H   AB  BB  HBP  SF  yearID       OBP
62242  aguaylu01  46  165  22    6   3    1985  0.377551
62243  aguilri01  10   36   1    0   0    1985  0.297297

In [7]:
appearances = appearances[['playerID', 'G_p', 'G_c', 'G_1b', 'G_2b', 'G_3b', 'G_ss', 'G_lf', 'G_cf', 'G_rf', 'yearID']]
appearances = appearances[appearances['yearID'] == 1985]
app1 = bat3.merge(appearances, on='playerID')

In [8]:
salaries = salaries[salaries['yearID'] == 1985]
salaries = salaries[['playerID', 'salary', 'yearID']]

In [9]:
salaries.head(2)

    playerID  salary  yearID
0  barkele01  870000    1985
1  bedrost01  550000    1985

In [10]:
master = master[['playerID', 'nameFirst', 'nameLast']]
salname = salaries.merge(master, on='playerID')
salname1 = salname[['playerID', 'salary', 'nameFirst', 'nameLast']]

In [20]:
df = salname1.merge(app1, on='playerID')

In [21]:
df1 = df[['nameFirst', 'nameLast', 'OBP', 'salary', 'G_p', 'G_c', 'G_1b', 'G_2b', 'G_3b', 'G_ss', 'G_lf', 'G_cf', 'G_rf', 'yearID_x']]

In [24]:
df1.head(2)

,nameFirst,nameLast,OBP,salary,G_p,G_c,G_1b,G_2b,G_3b,G_ss,G_lf,G_cf,G_rf,yearID_x
0,Bruce,Benedict,0.278970,545000,0,70,0,0,0,0,0,0,0,1985
1,Rick,Cerone,0.287975,625000,0,90,0,0,0,0,0,0,0,1985